# Latitude Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
City..::..Latitude Property
City Class See Also
---
Latitude of the city
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Latitude { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Latitude As Double
	Get
```

Visual C++
---
```text
public:
property double Latitude {
	double get ();
}
```

# Remarks
A read only property that contains the latitude of the city. The value returned is in radians, ranging from -PI to +PI.
# See Also
City Class
Autodesk.Revit.DB Namespace